// TODO add all pulls and test block by block

const targetPulls = [
  ["тренировка", "звонок", "отдых"],
  ["покупка", "свидание", "встреча"],
  ["оплата", "поездка", "экзамен"],
  ["собрание", "уборка", "работа"],
  ["отдых", "встреча", "собрание"],
  ["экзамен", "оплата", "работа"],
];

const distractorPulls = [
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
  ["выходной", "отпуск", "магазин", "пробежка", "переезд", "ужин", "офис", "занятие", "лекция"],
];

export default function getRandomPullSet() {
  const pullNum = Math.floor(Math.random() * targetPulls.length);
  return [targetPulls[pullNum], distractorPulls[pullNum]];
}
